# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
from random import randint

N = int(input("Введите количество элементов в массиве"))
array = []
for i in range(0,N):
    t = randint(0,10)
    array.append(t)
print(array)

X = int(input("Введите значение X"))
m = 0
for i in range(1,len(array)):
    if X == array[i]:
        m += 1
print(m)

